# Contains Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
GeomCombinationSet..::..Contains Method
GeomCombinationSet Class See Also
---
Tests for the existence of an GeomCombination within the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Contains(
	GeomCombination item
)
```

Visual Basic
---
```text
Public Overridable Function Contains ( _
	item As GeomCombination _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Contains(
	GeomCombination^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..GeomCombinationThe element to be searched for.
# ### Return Value
The Contains method returns True if the GeomCombination is within the set, otherwise False.
# See Also
GeomCombinationSet Class
Autodesk.Revit.DB Namespace